tests/org.jboss.tools.bpel.ui.bot.test/messages/Hello_World_Header_Ode/Hello_World_Header_Ode_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://www.jboss.org/bpel/examples/wsdl">
   <soapenv:Header>
      <ns:conversationId xmlns:ns="http://www.jboss.org/cid">12345</ns:conversationId>
   </soapenv:Header>
   <soapenv:Body>
      <wsdl:hello>
         <TestPart>Test</TestPart>
      </wsdl:hello>
   </soapenv:Body>
</soapenv:Envelope>