src/main/resources/messages/bpel_plain_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://www.jboss.org/bpel/examples/wsdl">
   <soapenv:Header/>
   <soapenv:Body>
      <wsdl:hello>
         <TestPart>Hello</TestPart>
      </wsdl:hello>
   </soapenv:Body>
</soapenv:Envelope>